app/Controllers/UserController.php

        public function login()
        {
            $session = session();
            helper(['form']);

            if ($this->request->getMethod() == 'post') {
                $userModel = new UserModels();
                $username = $this->request->getPost('username');
                $password = $this->request->getPost('password');

                $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'Epestia'
 LIMIT 1

        public function information()
        {
            if (!session()->has('user_id')) {
                return redirect()->to('login')->with('error', 'Veuillez vous connecter.');
            }

            $userModel = new UserModels();
            $user = $userModel->find(session()->get('user_id'));
---
SELECT *
FROM `user`
WHERE `user`.`id` = '4'

    public function allUsers()
    {
        $userModel = new UserModels();
        $users = $userModel->select('username, role')->findAll();
---
SELECT `username`, `role`
FROM `user`